brunch_rails/app/controllers/favorites_controller.rb

  def show
    @Favorites = Favorite.all
---
SELECT  "favorites".* FROM "favorites" WHERE (:id) LIMIT ?  [["LIMIT", 1]]