brunch_rails/app/controllers/favorites_controller.rb

  def create
    @favorite = Favorite.new(fav_params)
    if @favorite.valid?
      @favorite.save()
---
INSERT INTO "favorites" ("name", "image", "address", "phone", "user_id") VALUES (?, ?, ?, ?, ?)  [["name", "Hole in the Wall"], ["image", "https://s3-media3.fl.yelpcdn.com/bphoto/fSb6urrSe4CzOMqU1hqnsg/o.jpg"], ["address", "New York"], ["phone", "+12126029991"], ["user_id", 1]]

  def show
    @user = User.find(params[:id])
    @Favorites = Favorite.where(:user_id => @user)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = 2

  def destroy
    @favorite = Favorite.find(params[:id])
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

  def one
    @fav = Favorite.find(params[:id])
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]