brunch_rails/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "this@this.com"], ["LIMIT", 1]]
---
  def create
    # find the user based on the email
	  @user = User.find_by_email(params[:session][:email])