brunch_rails/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "auth_token") VALUES (?, ?, ?, ?)  [["name", "R"], ["email", "r@r.com"], ["password_digest", "$2a$10$YcvsKWpd/4Ln2aSPmEoU9..eoFO9YF/uIMAmfm/TUMQpXq1uqvPwK"], ["auth_token", "LdCcG61RCVWKXbp6beD6dFMH"]]
---
  def create
    puts user_params.inspect()
    @user = User.new(user_params)
    # check if the user is valid
    if @user.valid?
      # if it is, save it
      @user.save()